{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "bd0b27ed",
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, TURTLE, JSON, CSV\n",
    "import subprocess\n",
    "import time\n",
    "import os\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import matplotlib.pyplot as plt\n",
    "import networkx as nx\n",
    "import glob\n",
    "import itertools\n",
    "import requests\n",
    "import csv\n",
    "from utility import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "39a9f70f",
   "metadata": {},
   "outputs": [],
   "source": [
    "current_directory = os.getcwd()\n",
    "BioPAX_Ontology_file_path = os.path.join(current_directory, '../../Data/BioPAX/BioPAXOntology/biopax-level3.owl')\n",
    "ReactomeBioPAX_file_path = os.path.join(current_directory, '../../Data/BioPAX/ReactomeBioPAX/Homo_sapiens_v96.owl')\n",
    "tgf_beta_pathway_path = os.path.join(current_directory, '../../Data/BioPAX/ReactomeBioPAX/R-HSA-9006936.xml')\n",
    "signaling_tgf_beta_complex = os.path.join(current_directory, '../../Data/BioPAX/ReactomeBioPAX/R-HSA-170834.xml')\n",
    "PathwayAbstractionsFolder = os.path.join(current_directory, '../../Results/PathwayAbstraction')\n",
    "\n",
    "prefixes = \"\"\"\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX bp3: <http://www.biopax.org/release/biopax-level3.owl#>\n",
    "\"\"\"\n",
    "endpoint = \"http://localhost:3030/tgf_beta\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "0160d685",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "10:49:17 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/../../Data/BioPAX/ReactomeBioPAX/R-HSA-170834.xml\n",
      "10:49:18 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/../../Data/BioPAX/BioPAXOntology/biopax-level3.owl\n",
      "10:49:18 INFO  Server          :: Running in read-only mode for /tgf_beta\n",
      "10:49:18 INFO  Server          :: Apache Jena Fuseki 4.9.0\n",
      "10:49:18 INFO  Config          :: FUSEKI_HOME=/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0\n",
      "10:49:18 INFO  Config          :: FUSEKI_BASE=/home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/run\n",
      "10:49:18 INFO  Config          :: Shiro file: file:///home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/run/shiro.ini\n",
      "10:49:18 INFO  Server          :: Database: in-memory, with files loaded\n",
      "10:49:18 INFO  Server          :: Path = /tgf_beta\n",
      "10:49:18 INFO  Server          ::   Memory: 16.0 GiB\n",
      "10:49:18 INFO  Server          ::   Java:   17.0.17\n",
      "10:49:18 INFO  Server          ::   OS:     Linux 7.0.13-100.fc43.x86_64 amd64\n",
      "10:49:18 INFO  Server          ::   PID:    59839\n",
      "10:49:18 INFO  Server          :: Started 2026/07/06 10:49:18 CEST on port 3030\n",
      "10:49:47 INFO  Fuseki          :: [1] GET http://localhost:3030/tgf_beta?query=%0APREFIX+rdf%3A+%3Chttp%3A//www.w3.org/1999/02/22-rdf-syntax-ns%23%3E%0APREFIX+rdfs%3A+%3Chttp%3A//www.w3.org/2000/01/rdf-schema%23%3E%0APREFIX+owl%3A+%3Chttp%3A//www.w3.org/2002/07/owl%23%3E%0APREFIX+bp3%3A+%3Chttp%3A//www.biopax.org/release/biopax-level3.owl%23%3E%0A%0ASELECT+DISTINCT+%3FsubPathwayID+%3FpathwayID%0AWHERE+%7B%0A++++%3Fpathway+rdf%3Atype+bp3%3APathway+.%0A++++%3Fpathway+bp3%3ApathwayComponent+%3FsubPathway+.%0A++++%3FsubPathway+rdf%3Atype+bp3%3APathway+.%0A%0A++++%3Fpathway+bp3%3Axref+%3FpathwayXref+.%0A++++%3FpathwayXref+rdf%3Atype+bp3%3AUnificationXref+.%0A++++%3FpathwayXref+bp3%3Adb+%22Reactome%22+.%0A++++%3FpathwayXref+bp3%3Aid+%3FpathwayID+.%0A++++%0A++++%3FsubPathway+bp3%3Axref+%3FsubPathwayXref+.%0A++++%3FsubPathwayXref+rdf%3Atype+bp3%3AUnificationXref+.%0A++++%3FsubPathwayXref+bp3%3Adb+%22Reactome%22+.%0A++++%3FsubPathwayXref+bp3%3Aid+%3FsubPathwayID+.%0A%7D%0A&format=csv&output=csv&results=csv\n",
      "10:49:47 INFO  Fuseki          :: [1] Query =  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX owl: <http://www.w3.org/2002/07/owl#> PREFIX bp3: <http://www.biopax.org/release/biopax-level3.owl#>  SELECT DISTINCT ?subPathwayID ?pathwayID WHERE {     ?pathway rdf:type bp3:Pathway .     ?pathway bp3:pathwayComponent ?subPathway .     ?subPathway rdf:type bp3:Pathway .      ?pathway bp3:xref ?pathwayXref .     ?pathwayXref rdf:type bp3:UnificationXref .     ?pathwayXref bp3:db \"Reactome\" .     ?pathwayXref bp3:id ?pathwayID .          ?subPathway bp3:xref ?subPathwayXref .     ?subPathwayXref rdf:type bp3:UnificationXref .     ?subPathwayXref bp3:db \"Reactome\" .     ?subPathwayXref bp3:id ?subPathwayID . } \n",
      "10:49:47 INFO  Fuseki          :: [1] 200 OK (48 ms)\n",
      "10:49:47 INFO  Fuseki          :: [2] GET http://localhost:3030/tgf_beta?query=%0APREFIX+rdf%3A+%3Chttp%3A//www.w3.org/1999/02/22-rdf-syntax-ns%23%3E%0APREFIX+rdfs%3A+%3Chttp%3A//www.w3.org/2000/01/rdf-schema%23%3E%0APREFIX+owl%3A+%3Chttp%3A//www.w3.org/2002/07/owl%23%3E%0APREFIX+bp3%3A+%3Chttp%3A//www.biopax.org/release/biopax-level3.owl%23%3E%0A%0ASELECT+DISTINCT+%3FpathwayID+%3FnextPathwayID%0AWHERE+%7B%0A++++%3Fpathway+rdf%3Atype+bp3%3APathway+.%0A++++%3FnextPathway+rdf%3Atype+bp3%3APathway+.%0A++++%0A++++%3Fpathway+bp3%3ApathwayOrder+%3FpathwayStep+.%0A++++%3FnextPathway+bp3%3ApathwayOrder+%3FnextStep+.%0A++++%0A++++%3FpathwayStep+bp3%3AnextStep+%3FnextStep+.%0A++++%0A++++FILTER+%28%3Fpathway+%21%3D+%3FnextPathway%29%0A%0A++++%3Fpathway+bp3%3Axref+%3FpathwayXref+.%0A++++%3FpathwayXref+rdf%3Atype+bp3%3AUnificationXref+.%0A++++%3FpathwayXref+bp3%3Adb+%22Reactome%22+.%0A++++%3FpathwayXref+bp3%3Aid+%3FpathwayID+.%0A++++%0A++++%3FnextPathway+bp3%3Axref+%3FnextPathwayXref+.%0A++++%3FnextPathwayXref+rdf%3Atype+bp3%3AUnificationXref+.%0A++++%3FnextPathwayXref+bp3%3Adb+%22Reactome%22+.%0A++++%3FnextPathwayXref+bp3%3Aid+%3FnextPathwayID+.%0A%7D%0A&format=csv&output=csv&results=csv\n",
      "10:49:47 INFO  Fuseki          :: [2] Query =  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX owl: <http://www.w3.org/2002/07/owl#> PREFIX bp3: <http://www.biopax.org/release/biopax-level3.owl#>  SELECT DISTINCT ?pathwayID ?nextPathwayID WHERE {     ?pathway rdf:type bp3:Pathway .     ?nextPathway rdf:type bp3:Pathway .          ?pathway bp3:pathwayOrder ?pathwayStep .     ?nextPathway bp3:pathwayOrder ?nextStep .          ?pathwayStep bp3:nextStep ?nextStep .          FILTER (?pathway != ?nextPathway)      ?pathway bp3:xref ?pathwayXref .     ?pathwayXref rdf:type bp3:UnificationXref .     ?pathwayXref bp3:db \"Reactome\" .     ?pathwayXref bp3:id ?pathwayID .          ?nextPathway bp3:xref ?nextPathwayXref .     ?nextPathwayXref rdf:type bp3:UnificationXref .     ?nextPathwayXref bp3:db \"Reactome\" .     ?nextPathwayXref bp3:id ?nextPathwayID . } \n",
      "10:49:47 INFO  Fuseki          :: [2] 200 OK (44 ms)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results saved in ../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_IsAComponentOf.csv\n",
      "Results saved in ../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_NextStepPathway.csv\n",
      "CSV output saved in ../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_PathwayAbstraction.tsv\n"
     ]
    }
   ],
   "source": [
    "query_is_a_component_of = \"\"\"\n",
    "SELECT DISTINCT ?subPathwayID ?pathwayID\n",
    "WHERE {\n",
    "    ?pathway rdf:type bp3:Pathway .\n",
    "    ?pathway bp3:pathwayComponent ?subPathway .\n",
    "    ?subPathway rdf:type bp3:Pathway .\n",
    "\n",
    "    ?pathway bp3:xref ?pathwayXref .\n",
    "    ?pathwayXref rdf:type bp3:UnificationXref .\n",
    "    ?pathwayXref bp3:db \"Reactome\" .\n",
    "    ?pathwayXref bp3:id ?pathwayID .\n",
    "    \n",
    "    ?subPathway bp3:xref ?subPathwayXref .\n",
    "    ?subPathwayXref rdf:type bp3:UnificationXref .\n",
    "    ?subPathwayXref bp3:db \"Reactome\" .\n",
    "    ?subPathwayXref bp3:id ?subPathwayID .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "query_next_step_pathway = \"\"\"\n",
    "SELECT DISTINCT ?pathwayID ?nextPathwayID\n",
    "WHERE {\n",
    "    ?pathway rdf:type bp3:Pathway .\n",
    "    ?nextPathway rdf:type bp3:Pathway .\n",
    "    \n",
    "    ?pathway bp3:pathwayOrder ?pathwayStep .\n",
    "    ?nextPathway bp3:pathwayOrder ?nextStep .\n",
    "    \n",
    "    ?pathwayStep bp3:nextStep ?nextStep .\n",
    "    \n",
    "    FILTER (?pathway != ?nextPathway)\n",
    "\n",
    "    ?pathway bp3:xref ?pathwayXref .\n",
    "    ?pathwayXref rdf:type bp3:UnificationXref .\n",
    "    ?pathwayXref bp3:db \"Reactome\" .\n",
    "    ?pathwayXref bp3:id ?pathwayID .\n",
    "    \n",
    "    ?nextPathway bp3:xref ?nextPathwayXref .\n",
    "    ?nextPathwayXref rdf:type bp3:UnificationXref .\n",
    "    ?nextPathwayXref bp3:db \"Reactome\" .\n",
    "    ?nextPathwayXref bp3:id ?nextPathwayID .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "endpoint = \"http://localhost:3030/tgf_beta\"\n",
    "command = [\n",
    "    '/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',\n",
    "    '--file', signaling_tgf_beta_complex,\n",
    "    '--file', BioPAX_Ontology_file_path,\n",
    "    '/tgf_beta'\n",
    "]\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(30)\n",
    "\n",
    "sparql = SPARQLWrapper(endpoint)\n",
    "\n",
    "sparql.setQuery(prefixes + query_is_a_component_of)\n",
    "sparql.setReturnFormat(CSV)\n",
    "try:\n",
    "    results = sparql.query().convert()\n",
    "    output_filename = os.path.join(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_IsAComponentOf.csv\")\n",
    "    with open(output_filename, 'wb') as f:\n",
    "        f.write(results)\n",
    "    print(f\"Results saved in {output_filename}\")\n",
    "except Exception as e:\n",
    "    print(f\"Error in IsAComponentOf SPARQL query: {e}\")\n",
    "iscomponentof = pd.read_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_IsAComponentOf.csv\", sep=\",\", header=0)\n",
    "new_col = [\"abstraction:IsAComponentOf\"]*len(iscomponentof)\n",
    "iscomponentof.insert(loc=1, column=\"interaction\", value=new_col)\n",
    "iscomponentof.to_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_IsAComponentOf.csv\", sep=\",\", header=True, index=False)\n",
    "\n",
    "sparql.setQuery(prefixes + query_next_step_pathway)\n",
    "sparql.setReturnFormat(CSV)\n",
    "try:\n",
    "    results = sparql.query().convert()\n",
    "    output_filename = os.path.join(\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_NextStepPathway.csv\")\n",
    "    with open(output_filename, 'wb') as f:\n",
    "        f.write(results)\n",
    "    print(f\"Results saved in {output_filename}\")\n",
    "except Exception as e:\n",
    "    print(f\"Error in NextStepPathway query: {e}\")\n",
    "\n",
    "nextsteppathway = pd.read_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_NextStepPathway.csv\", sep=\",\", header=0)\n",
    "new_col = [\"abstraction:NextStepPathway\"]*len(nextsteppathway)\n",
    "nextsteppathway.insert(loc=1, column=\"interaction\", value=new_col)\n",
    "nextsteppathway.to_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_NextStepPathway.csv\", sep=\",\", header=True, index=False)\n",
    "\n",
    "try:\n",
    "    q1 = pd.read_csv(os.path.join(\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_IsAComponentOf.csv\"), header=None)\n",
    "    q2 = pd.read_csv(os.path.join(\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_NextStepPathway.csv\"), header=None)\n",
    "    q1 = q1.drop(0).reset_index(drop=True)\n",
    "    q2 = q2.drop(0).reset_index(drop=True)\n",
    "    concat_df = pd.concat([q1, q2], ignore_index=True)\n",
    "    output_csv = os.path.join(\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_PathwayAbstraction.tsv\")\n",
    "    concat_df.to_csv(output_csv, sep=',', header=False, index=False)\n",
    "    print(f\"CSV output saved in {output_csv}\")\n",
    "except Exception as e:\n",
    "    print(f\"Error: {e}\")\n",
    "\n",
    "process.kill()\n",
    "time.sleep(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "44af66ca",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Fuseki command: ['/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server', '--file', '/home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/../../Data/BioPAX/ReactomeBioPAX/R-HSA-170834.xml', '--file', '/home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/../../Data/BioPAX/BioPAXOntology/biopax-level3.owl', '/tgf_beta']\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "10:50:58 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/../../Data/BioPAX/ReactomeBioPAX/R-HSA-170834.xml\n",
      "10:50:59 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/../../Data/BioPAX/BioPAXOntology/biopax-level3.owl\n",
      "10:50:59 INFO  Server          :: Running in read-only mode for /tgf_beta\n",
      "10:50:59 INFO  Server          :: Apache Jena Fuseki 4.9.0\n",
      "10:50:59 INFO  Config          :: FUSEKI_HOME=/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0\n",
      "10:50:59 INFO  Config          :: FUSEKI_BASE=/home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/run\n",
      "10:50:59 INFO  Config          :: Shiro file: file:///home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/run/shiro.ini\n",
      "10:50:59 INFO  Server          :: Database: in-memory, with files loaded\n",
      "10:50:59 INFO  Server          :: Path = /tgf_beta\n",
      "10:51:00 INFO  Server          ::   Memory: 16.0 GiB\n",
      "10:51:00 INFO  Server          ::   Java:   17.0.17\n",
      "10:51:00 INFO  Server          ::   OS:     Linux 7.0.13-100.fc43.x86_64 amd64\n",
      "10:51:00 INFO  Server          ::   PID:    60044\n",
      "10:51:00 INFO  Server          :: Started 2026/07/06 10:51:00 CEST on port 3030\n",
      "10:51:28 INFO  Fuseki          :: [1] GET http://localhost:3030/tgf_beta?query=%0APREFIX+rdf%3A+%3Chttp%3A//www.w3.org/1999/02/22-rdf-syntax-ns%23%3E%0APREFIX+rdfs%3A+%3Chttp%3A//www.w3.org/2000/01/rdf-schema%23%3E%0APREFIX+owl%3A+%3Chttp%3A//www.w3.org/2002/07/owl%23%3E%0APREFIX+bp3%3A+%3Chttp%3A//www.biopax.org/release/biopax-level3.owl%23%3E%0A+%0ASELECT+DISTINCT+%3FpathwayID+%3FentityID%0AWHERE+%7B%0A++++VALUES+%3Fdb+%7B+%22UniProt%22+%22UniProt+Isoform%22+%7D%0A%0A++++%3Fpathway+rdf%3Atype+bp3%3APathway+.%0A++++%3Fpathway+%28bp3%3ApathwayComponent+%7C+bp3%3ApathwayOrder/bp3%3AstepProcess%29%2A+%3Finteraction+.%0A++++%3Finteraction+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3AInteraction+.%0A++++%3Fpathway+bp3%3Axref+%3FpathwayXref+.%0A++++%3FpathwayXref+rdf%3Atype+bp3%3AUnificationXref+%3B%0A++++++++++++++++++++bp3%3Adb+%22Reactome%22+%3B%0A++++++++++++++++++++bp3%3Aid+%3FpathwayID+.%0A%0A++++VALUES+%3Frelation+%7B+bp3%3Aleft+bp3%3Aright+bp3%3Aparticipant+bp3%3Acontroller+%7D%0A++++%3Finteraction+%3Frelation+%3Fentity+.%0A++++%0A++++%3Fentity+%28bp3%3Acomponent+%7C+bp3%3AmemberPhysicalEntity%29%2A+%3FentityCompo+.%0A%0A++++%3FentityCompo+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3APhysicalEntity+.%0A++++%3FentityCompo+bp3%3AentityReference+%3FentityRef+.%0A++++%3FentityRef+bp3%3Axref+%3FentityRefXref+.%0A++++%3FentityRefXref+rdf%3Atype+bp3%3AUnificationXref+%3B%0A++++++++++++++++++++bp3%3Adb+%3Fdb+%3B%0A++++++++++++++++++++bp3%3Aid+%3FentityID+.%0A%7D%0A&format=csv&output=csv&results=csv\n",
      "10:51:28 INFO  Fuseki          :: [1] Query =  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX owl: <http://www.w3.org/2002/07/owl#> PREFIX bp3: <http://www.biopax.org/release/biopax-level3.owl#>   SELECT DISTINCT ?pathwayID ?entityID WHERE {     VALUES ?db { \"UniProt\" \"UniProt Isoform\" }      ?pathway rdf:type bp3:Pathway .     ?pathway (bp3:pathwayComponent | bp3:pathwayOrder/bp3:stepProcess)* ?interaction .     ?interaction rdf:type/(rdfs:subClassOf*) bp3:Interaction .     ?pathway bp3:xref ?pathwayXref .     ?pathwayXref rdf:type bp3:UnificationXref ;                     bp3:db \"Reactome\" ;                     bp3:id ?pathwayID .      VALUES ?relation { bp3:left bp3:right bp3:participant bp3:controller }     ?interaction ?relation ?entity .          ?entity (bp3:component | bp3:memberPhysicalEntity)* ?entityCompo .      ?entityCompo rdf:type/(rdfs:subClassOf*) bp3:PhysicalEntity .     ?entityCompo bp3:entityReference ?entityRef .     ?entityRef bp3:xref ?entityRefXref .     ?entityRefXref rdf:type bp3:UnificationXref ;                     bp3:db ?db ;                     bp3:id ?entityID . } \n",
      "10:51:29 INFO  Fuseki          :: [1] 200 OK (606 ms)\n",
      "10:51:29 INFO  Fuseki          :: [2] GET http://localhost:3030/tgf_beta?query=%0APREFIX+rdf%3A+%3Chttp%3A//www.w3.org/1999/02/22-rdf-syntax-ns%23%3E%0APREFIX+rdfs%3A+%3Chttp%3A//www.w3.org/2000/01/rdf-schema%23%3E%0APREFIX+owl%3A+%3Chttp%3A//www.w3.org/2002/07/owl%23%3E%0APREFIX+bp3%3A+%3Chttp%3A//www.biopax.org/release/biopax-level3.owl%23%3E%0A+%0ASELECT+%3FpathwayID+%28COUNT%28DISTINCT+%3FentityID%29+AS+%3FnbID%29%0AWHERE+%7B%0A++++VALUES+%3Fdb+%7B+%22UniProt%22+%22UniProt+Isoform%22+%7D%0A%0A++++%3Fpathway+rdf%3Atype+bp3%3APathway+.%0A++++%3Fpathway+%28bp3%3ApathwayComponent+%7C+bp3%3ApathwayOrder/bp3%3AstepProcess%29%2A+%3Finteraction+.%0A++++%3Finteraction+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3AInteraction+.%0A++++%3Fpathway+bp3%3Axref+%3FpathwayXref+.%0A++++%3FpathwayXref+rdf%3Atype+bp3%3AUnificationXref+%3B%0A++++++++++++++++++++bp3%3Adb+%22Reactome%22+%3B%0A++++++++++++++++++++bp3%3Aid+%3FpathwayID+.%0A%0A++++VALUES+%3Frelation+%7B+bp3%3Aleft+bp3%3Aright+bp3%3Aparticipant+bp3%3Acontroller+%7D%0A++++%3Finteraction+%3Frelation+%3Fentity+.%0A++++%0A++++%3Fentity+%28bp3%3Acomponent+%7C+bp3%3AmemberPhysicalEntity%29%2A+%3FentityCompo+.%0A%0A++++%3FentityCompo+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3APhysicalEntity+.%0A++++%3FentityCompo+bp3%3AentityReference+%3FentityRef+.%0A++++%3FentityRef+bp3%3Axref+%3FentityRefXref+.%0A++++%3FentityRefXref+rdf%3Atype+bp3%3AUnificationXref+%3B%0A++++++++++++++++++++bp3%3Adb+%3Fdb+%3B%0A++++++++++++++++++++bp3%3Aid+%3FentityID+.%0A%7D%0AGROUP+BY+%3FpathwayID%0A&format=csv&output=csv&results=csv\n",
      "10:51:29 INFO  Fuseki          :: [2] Query =  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX owl: <http://www.w3.org/2002/07/owl#> PREFIX bp3: <http://www.biopax.org/release/biopax-level3.owl#>   SELECT ?pathwayID (COUNT(DISTINCT ?entityID) AS ?nbID) WHERE {     VALUES ?db { \"UniProt\" \"UniProt Isoform\" }      ?pathway rdf:type bp3:Pathway .     ?pathway (bp3:pathwayComponent | bp3:pathwayOrder/bp3:stepProcess)* ?interaction .     ?interaction rdf:type/(rdfs:subClassOf*) bp3:Interaction .     ?pathway bp3:xref ?pathwayXref .     ?pathwayXref rdf:type bp3:UnificationXref ;                     bp3:db \"Reactome\" ;                     bp3:id ?pathwayID .      VALUES ?relation { bp3:left bp3:right bp3:participant bp3:controller }     ?interaction ?relation ?entity .          ?entity (bp3:component | bp3:memberPhysicalEntity)* ?entityCompo .      ?entityCompo rdf:type/(rdfs:subClassOf*) bp3:PhysicalEntity .     ?entityCompo bp3:entityReference ?entityRef .     ?entityRef bp3:xref ?entityRefXref .     ?entityRefXref rdf:type bp3:UnificationXref ;                     bp3:db ?db ;                     bp3:id ?entityID . } GROUP BY ?pathwayID \n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results saved in ../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_UpPerPathway.csv\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "10:51:29 INFO  Fuseki          :: [2] 200 OK (212 ms)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Results saved in ../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_NbUpPerPathway.csv\n"
     ]
    }
   ],
   "source": [
    "# query_up_per_pathway = \"\"\" \n",
    "# SELECT DISTINCT ?pathwayID ?entityID\n",
    "# WHERE {\n",
    "#     VALUES ?db { \"UniProt\" \"UniProt Isoform\" }\n",
    "#     ?pathway rdf:type bp3:Pathway .\n",
    "#     ?pathway (bp3:pathwayComponent)*|(bp3:pathwayOrder/bp3:stepProcess)* ?interaction .\n",
    "#     ?interaction rdf:type/(rdfs:subClassOf*) bp3:Interaction .\n",
    "#     ?pathway bp3:xref ?pathwayXref .\n",
    "#     ?pathwayXref rdf:type bp3:UnificationXref .\n",
    "#     ?pathwayXref bp3:db \"Reactome\" .\n",
    "#     ?pathwayXref bp3:id ?pathwayID .\n",
    "\n",
    "#     VALUES ?relation { bp3:left bp3:right bp3:participant bp3:controller }\n",
    "#     ?interaction ?relation ?entity .\n",
    "\n",
    "#     ?entity (bp3:component*)|(bp3:memberPhysicalEntity*)|(bp3:component*/bp3:memberPhysicalEntity*)|(bp3:memberPhysicalEntity*/bp3:component*)|(bp3:component*/bp3:memberPhysicalEntity*/bp3:component*) ?entityCompo .\n",
    "#     ?entityCompo rdf:type/(rdfs:subClassOf*) bp3:PhysicalEntity .\n",
    "#     ?entityCompo bp3:entityReference ?entityRef .\n",
    "#     ?entityRef bp3:xref ?entityRefXref .\n",
    "#     ?entityRefXref rdf:type bp3:UnificationXref .\n",
    "#     ?entityRefXref bp3:db ?db .\n",
    "#     ?entityRefXref bp3:id ?entityID .\n",
    "# } \n",
    "# \"\"\"\n",
    "\n",
    "# query_nb_up_per_pathway = \"\"\" \n",
    "# SELECT ?pathwayID (COUNT(DISTINCT ?entityID) AS ?nbID)\n",
    "# WHERE {\n",
    "#     VALUES ?db { \"UniProt\" \"UniProt Isoform\" }\n",
    "#     ?pathway rdf:type bp3:Pathway .\n",
    "#     ?pathway bp3:displayName ?pathwayName .\n",
    "#     ?pathway (bp3:pathwayComponent)*|(bp3:pathwayOrder/bp3:stepProcess)* ?interaction .\n",
    "#     ?interaction rdf:type/(rdfs:subClassOf*) bp3:Interaction .\n",
    "#     ?pathway bp3:xref ?pathwayXref .\n",
    "#     ?pathwayXref rdf:type bp3:UnificationXref .\n",
    "#     ?pathwayXref bp3:db \"Reactome\" .\n",
    "#     ?pathwayXref bp3:id ?pathwayID .\n",
    "\n",
    "#     VALUES ?relation { bp3:left bp3:right bp3:participant bp3:controller }\n",
    "#     ?interaction ?relation ?entity .\n",
    "\n",
    "#     ?entity (bp3:component*)|(bp3:memberPhysicalEntity*)|(bp3:component*/bp3:memberPhysicalEntity*)|(bp3:memberPhysicalEntity*/bp3:component*)|(bp3:component*/bp3:memberPhysicalEntity*/bp3:component*) ?entityCompo .\n",
    "#     ?entityCompo rdf:type/(rdfs:subClassOf*) bp3:PhysicalEntity .\n",
    "#     ?entityCompo bp3:entityReference ?entityRef .\n",
    "#     ?entityRef bp3:xref ?entityRefXref .\n",
    "#     ?entityRefXref rdf:type bp3:UnificationXref .\n",
    "#     ?entityRefXref bp3:db ?db .\n",
    "#     ?entityRefXref bp3:id ?entityID .\n",
    "# }\n",
    "# GROUP BY ?pathwayID\n",
    "# \"\"\"\n",
    "\n",
    "query_up_per_pathway = \"\"\" \n",
    "SELECT DISTINCT ?pathwayID ?entityID\n",
    "WHERE {\n",
    "    VALUES ?db { \"UniProt\" \"UniProt Isoform\" }\n",
    "\n",
    "    ?pathway rdf:type bp3:Pathway .\n",
    "    ?pathway (bp3:pathwayComponent | bp3:pathwayOrder/bp3:stepProcess)* ?interaction .\n",
    "    ?interaction rdf:type/(rdfs:subClassOf*) bp3:Interaction .\n",
    "    ?pathway bp3:xref ?pathwayXref .\n",
    "    ?pathwayXref rdf:type bp3:UnificationXref ;\n",
    "                    bp3:db \"Reactome\" ;\n",
    "                    bp3:id ?pathwayID .\n",
    "\n",
    "    VALUES ?relation { bp3:left bp3:right bp3:participant bp3:controller }\n",
    "    ?interaction ?relation ?entity .\n",
    "    \n",
    "    ?entity (bp3:component | bp3:memberPhysicalEntity)* ?entityCompo .\n",
    "\n",
    "    ?entityCompo rdf:type/(rdfs:subClassOf*) bp3:PhysicalEntity .\n",
    "    ?entityCompo bp3:entityReference ?entityRef .\n",
    "    ?entityRef bp3:xref ?entityRefXref .\n",
    "    ?entityRefXref rdf:type bp3:UnificationXref ;\n",
    "                    bp3:db ?db ;\n",
    "                    bp3:id ?entityID .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "query_nb_up_per_pathway = \"\"\" \n",
    "SELECT ?pathwayID (COUNT(DISTINCT ?entityID) AS ?nbID)\n",
    "WHERE {\n",
    "    VALUES ?db { \"UniProt\" \"UniProt Isoform\" }\n",
    "\n",
    "    ?pathway rdf:type bp3:Pathway .\n",
    "    ?pathway (bp3:pathwayComponent | bp3:pathwayOrder/bp3:stepProcess)* ?interaction .\n",
    "    ?interaction rdf:type/(rdfs:subClassOf*) bp3:Interaction .\n",
    "    ?pathway bp3:xref ?pathwayXref .\n",
    "    ?pathwayXref rdf:type bp3:UnificationXref ;\n",
    "                    bp3:db \"Reactome\" ;\n",
    "                    bp3:id ?pathwayID .\n",
    "\n",
    "    VALUES ?relation { bp3:left bp3:right bp3:participant bp3:controller }\n",
    "    ?interaction ?relation ?entity .\n",
    "    \n",
    "    ?entity (bp3:component | bp3:memberPhysicalEntity)* ?entityCompo .\n",
    "\n",
    "    ?entityCompo rdf:type/(rdfs:subClassOf*) bp3:PhysicalEntity .\n",
    "    ?entityCompo bp3:entityReference ?entityRef .\n",
    "    ?entityRef bp3:xref ?entityRefXref .\n",
    "    ?entityRefXref rdf:type bp3:UnificationXref ;\n",
    "                    bp3:db ?db ;\n",
    "                    bp3:id ?entityID .\n",
    "}\n",
    "GROUP BY ?pathwayID\n",
    "\"\"\"\n",
    "\n",
    "endpoint = \"http://localhost:3030/tgf_beta\"\n",
    "\n",
    "command = [\n",
    "    '/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',\n",
    "    '--file', signaling_tgf_beta_complex,\n",
    "    '--file', BioPAX_Ontology_file_path,\n",
    "    '/tgf_beta'\n",
    "]\n",
    "print(\"Fuseki command:\", command)\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(30)\n",
    "\n",
    "sparql = SPARQLWrapper(endpoint)\n",
    "\n",
    "sparql.setQuery(prefixes + query_up_per_pathway)\n",
    "sparql.setReturnFormat(CSV)\n",
    "try:\n",
    "    results = sparql.query().convert()\n",
    "    output_filename = os.path.join(\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_UpPerPathway.csv\")\n",
    "    with open(output_filename, 'wb') as f:\n",
    "        f.write(results)\n",
    "    print(f\"Results saved in {output_filename}\")\n",
    "except Exception as e:\n",
    "    print(f\"Error: {e}\")\n",
    "\n",
    "sparql.setQuery(prefixes + query_nb_up_per_pathway)\n",
    "sparql.setReturnFormat(CSV)\n",
    "try:\n",
    "    results = sparql.query().convert()\n",
    "    output_filename = os.path.join(\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_NbUpPerPathway.csv\")\n",
    "    with open(output_filename, 'wb') as f:\n",
    "        f.write(results)\n",
    "    print(f\"Results saved in {output_filename}\")\n",
    "except Exception as e:\n",
    "    print(f\"Error: {e}\")\n",
    "\n",
    "process.kill()\n",
    "time.sleep(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "ad9999ed",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pathway abstraction loaded in networkx: MultiDiGraph with 7 nodes and 6 edges\n",
      "Fuseki command: ['/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server', '--file', '/home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/../../Data/BioPAX/ReactomeBioPAX/R-HSA-170834.xml', '--file', '/home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/../../Data/BioPAX/BioPAXOntology/biopax-level3.owl', '/tgf_beta']\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_59697/3808403658.py:21: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  pathway = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:22: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  id = row[1]\n",
      "10:52:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/../../Data/BioPAX/ReactomeBioPAX/R-HSA-170834.xml\n",
      "10:52:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/../../Data/BioPAX/BioPAXOntology/biopax-level3.owl\n",
      "10:52:47 INFO  Server          :: Running in read-only mode for /tgf_beta\n",
      "10:52:47 INFO  Server          :: Apache Jena Fuseki 4.9.0\n",
      "10:52:47 INFO  Config          :: FUSEKI_HOME=/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0\n",
      "10:52:47 INFO  Config          :: FUSEKI_BASE=/home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/run\n",
      "10:52:47 INFO  Config          :: Shiro file: file:///home/cbeust/Projects/2026/AbstractionReactomeTopPathways/Scripts/01_PathwayAbstraction/run/shiro.ini\n",
      "10:52:47 INFO  Server          :: Database: in-memory, with files loaded\n",
      "10:52:47 INFO  Server          :: Path = /tgf_beta\n",
      "10:52:47 INFO  Server          ::   Memory: 16.0 GiB\n",
      "10:52:47 INFO  Server          ::   Java:   17.0.17\n",
      "10:52:47 INFO  Server          ::   OS:     Linux 7.0.13-100.fc43.x86_64 amd64\n",
      "10:52:47 INFO  Server          ::   PID:    60256\n",
      "10:52:47 INFO  Server          :: Started 2026/07/06 10:52:47 CEST on port 3030\n",
      "10:53:16 INFO  Fuseki          :: [1] GET http://localhost:3030/tgf_beta?query=%0APREFIX+rdf%3A+%3Chttp%3A//www.w3.org/1999/02/22-rdf-syntax-ns%23%3E%0APREFIX+rdfs%3A+%3Chttp%3A//www.w3.org/2000/01/rdf-schema%23%3E%0APREFIX+owl%3A+%3Chttp%3A//www.w3.org/2002/07/owl%23%3E%0APREFIX+bp3%3A+%3Chttp%3A//www.biopax.org/release/biopax-level3.owl%23%3E%0A%0ASELECT+%28COUNT%28DISTINCT+%3Fid%29+AS+%3FnbID%29%0AWHERE+%7B%0AVALUES+%3Fdb+%7B+%22UniProt%22+%22UniProt+Isoform%22+%7D%0A%3FentityRef+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3AProteinReference+.%0A%3FentityRef+bp3%3Axref+%3FentityRefXref+.%0A%3FentityRefXref+bp3%3Adb+%3Fdb+.%0A%3FentityRefXref+bp3%3Aid+%3Fid+.%0A%7D%0A&format=json&output=json&results=json\n",
      "10:53:16 INFO  Fuseki          :: [1] Query =  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX owl: <http://www.w3.org/2002/07/owl#> PREFIX bp3: <http://www.biopax.org/release/biopax-level3.owl#>  SELECT (COUNT(DISTINCT ?id) AS ?nbID) WHERE { VALUES ?db { \"UniProt\" \"UniProt Isoform\" } ?entityRef rdf:type/(rdfs:subClassOf*) bp3:ProteinReference . ?entityRef bp3:xref ?entityRefXref . ?entityRefXref bp3:db ?db . ?entityRefXref bp3:id ?id . } \n",
      "10:53:16 INFO  Fuseki          :: [1] 200 OK (70 ms)\n",
      "/tmp/ipykernel_59697/3808403658.py:47: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  pathway1 = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:48: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  pathway2 = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:49: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  interaction = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:59: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:60: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:61: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:62: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f'{str(row[0])}-<>{str(row[2])}'\n",
      "/tmp/ipykernel_59697/3808403658.py:59: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:60: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:61: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:62: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f'{str(row[0])}-<>{str(row[2])}'\n",
      "/tmp/ipykernel_59697/3808403658.py:59: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:60: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:61: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:62: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f'{str(row[0])}-<>{str(row[2])}'\n",
      "/tmp/ipykernel_59697/3808403658.py:59: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:60: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:61: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:62: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f'{str(row[0])}-<>{str(row[2])}'\n",
      "/tmp/ipykernel_59697/3808403658.py:59: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:60: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:61: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:62: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f'{str(row[0])}-<>{str(row[2])}'\n",
      "/tmp/ipykernel_59697/3808403658.py:59: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:60: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:61: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:62: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f'{str(row[0])}-<>{str(row[2])}'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "93\n",
      "{'R-HSA-2173791-<>R-HSA-170834': 0, 'R-HSA-2173793-<>R-HSA-170834': 0, 'R-HSA-2173789-<>R-HSA-170834': 0, 'R-HSA-2173795-<>R-HSA-2173793': 0.6007738604289302, 'R-HSA-2173796-<>R-HSA-2173793': 0.6007738604289302, 'R-HSA-2173788-<>R-HSA-2173789': 0.703958096664161}\n",
      "          source                 interaction         target    weight\n",
      "0  R-HSA-2173791  abstraction:IsAComponentOf   R-HSA-170834  0.000000\n",
      "1  R-HSA-2173793  abstraction:IsAComponentOf   R-HSA-170834  0.000000\n",
      "2  R-HSA-2173789  abstraction:IsAComponentOf   R-HSA-170834  0.000000\n",
      "3  R-HSA-2173795  abstraction:IsAComponentOf  R-HSA-2173793  0.600774\n",
      "4  R-HSA-2173796  abstraction:IsAComponentOf  R-HSA-2173793  0.600774\n",
      "          source                  interaction         target    weight\n",
      "0  R-HSA-2173795  abstraction:NextStepPathway  R-HSA-2173788  0.682452\n",
      "1  R-HSA-2173795  abstraction:NextStepPathway  R-HSA-2173796  0.600774\n",
      "2  R-HSA-2173796  abstraction:NextStepPathway  R-HSA-2173795  0.600774\n",
      "3  R-HSA-2173789  abstraction:NextStepPathway  R-HSA-2173791  0.562308\n",
      "4  R-HSA-2173789  abstraction:NextStepPathway  R-HSA-2173788  0.703958\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/tmp/ipykernel_59697/3808403658.py:77: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  if row[1] == \"abstraction:NextStepPathway\":\n",
      "/tmp/ipykernel_59697/3808403658.py:78: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  Pathway1 = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:79: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  Pathway2 = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:88: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  if row[1] == \"abstraction:NextStepPathway\":\n",
      "/tmp/ipykernel_59697/3808403658.py:89: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:90: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:91: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:92: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f\"{str(row[0])}->{str(row[2])}\"\n",
      "/tmp/ipykernel_59697/3808403658.py:88: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  if row[1] == \"abstraction:NextStepPathway\":\n",
      "/tmp/ipykernel_59697/3808403658.py:89: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:90: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:91: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:92: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f\"{str(row[0])}->{str(row[2])}\"\n",
      "/tmp/ipykernel_59697/3808403658.py:88: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  if row[1] == \"abstraction:NextStepPathway\":\n",
      "/tmp/ipykernel_59697/3808403658.py:89: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:90: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:91: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:92: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f\"{str(row[0])}->{str(row[2])}\"\n",
      "/tmp/ipykernel_59697/3808403658.py:88: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  if row[1] == \"abstraction:NextStepPathway\":\n",
      "/tmp/ipykernel_59697/3808403658.py:89: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:90: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:91: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:92: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f\"{str(row[0])}->{str(row[2])}\"\n",
      "/tmp/ipykernel_59697/3808403658.py:88: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  if row[1] == \"abstraction:NextStepPathway\":\n",
      "/tmp/ipykernel_59697/3808403658.py:89: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:90: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:91: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:92: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f\"{str(row[0])}->{str(row[2])}\"\n",
      "/tmp/ipykernel_59697/3808403658.py:88: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  if row[1] == \"abstraction:NextStepPathway\":\n",
      "/tmp/ipykernel_59697/3808403658.py:89: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'source'] = row[0]\n",
      "/tmp/ipykernel_59697/3808403658.py:90: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
      "/tmp/ipykernel_59697/3808403658.py:91: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  weighted_graph.at[counter_rows, 'target'] = row[2]\n",
      "/tmp/ipykernel_59697/3808403658.py:92: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`\n",
      "  key = f\"{str(row[0])}->{str(row[2])}\"\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "SELECT (COUNT(DISTINCT ?id) AS ?nbID)\n",
    "WHERE {\n",
    "VALUES ?db { \"UniProt\" \"UniProt Isoform\" }\n",
    "?entityRef rdf:type/(rdfs:subClassOf*) bp3:ProteinReference .\n",
    "?entityRef bp3:xref ?entityRefXref .\n",
    "?entityRefXref bp3:db ?db .\n",
    "?entityRefXref bp3:id ?id .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "isacomponentof = pd.read_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_IsAComponentOf.csv\", sep=',', header=0)\n",
    "nextsteppathway = pd.read_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_NextStepPathway.csv\", sep=',', header=0)\n",
    "G = create_networkx_graph(isacomponentof)\n",
    "root = [node for node in G.nodes() if G.out_degree(node) == 0]\n",
    "\n",
    "up_per_pathway = pd.read_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_UpPerPathway.csv\", sep=\",\", header=0)\n",
    "\n",
    "dico_er_per_pathway = dict()\n",
    "for index, row in up_per_pathway.iterrows():\n",
    "    pathway = row[0]\n",
    "    id = row[1]\n",
    "    if not pathway in dico_er_per_pathway.keys():\n",
    "        dico_er_per_pathway[pathway] = [id]\n",
    "    else:\n",
    "        dico_er_per_pathway[pathway] += [id]\n",
    "\n",
    "command = [\n",
    "    '/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',\n",
    "    '--file', signaling_tgf_beta_complex,\n",
    "    '--file', BioPAX_Ontology_file_path,\n",
    "    '/tgf_beta'\n",
    "]\n",
    "print(\"Fuseki command:\", command)\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(30)\n",
    "sparql = SPARQLWrapper(endpoint)\n",
    "sparql.setQuery(prefixes + query)\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "nbEr_total = int(results[\"results\"][\"bindings\"][0][\"nbID\"][\"value\"])\n",
    "print(nbEr_total)\n",
    "\n",
    "dico_isacomponentof_resnik_er = dict()\n",
    "for index, row in isacomponentof.iterrows():\n",
    "    pathway1 = row[0]\n",
    "    pathway2 = row[2]\n",
    "    interaction = row[1]\n",
    "    if interaction == \"abstraction:IsAComponentOf\":\n",
    "        score = resnik_similarity_ER(G, root[0], pathway1, pathway2, dico_er_per_pathway, nbEr_total)\n",
    "        key = f\"{str(pathway1)}-<>{str(pathway2)}\"\n",
    "        dico_isacomponentof_resnik_er[key] = score\n",
    "print(dico_isacomponentof_resnik_er)\n",
    "\n",
    "weighted_graph = pd.DataFrame(columns=['source', 'interaction', 'target', 'weight'])\n",
    "counter_rows = 0\n",
    "for index, row in isacomponentof.iterrows():\n",
    "    weighted_graph.at[counter_rows, 'source'] = row[0]\n",
    "    weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
    "    weighted_graph.at[counter_rows, 'target'] = row[2]\n",
    "    key = f'{str(row[0])}-<>{str(row[2])}'\n",
    "    weight = dico_isacomponentof_resnik_er[key]\n",
    "    weighted_graph.at[counter_rows, 'weight'] = weight\n",
    "    counter_rows += 1\n",
    "\n",
    "weighted_graph.to_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_IsAComponentOf_ResnikER.csv\", sep=\",\", header=True, index=False)\n",
    "\n",
    "process.kill()\n",
    "time.sleep(30)\n",
    "\n",
    "# WEIGHT NEXTSTEPPATHWAY EDGES\n",
    "dico_next_step_er = dict()\n",
    "distribution_weight_er = list()\n",
    "\n",
    "for item, row in nextsteppathway.iterrows():\n",
    "    if row[1] == \"abstraction:NextStepPathway\":\n",
    "        Pathway1 = row[0]\n",
    "        Pathway2 = row[2]\n",
    "        key = f\"{str(Pathway1)}->{str(Pathway2)}\"\n",
    "        weight_er = compute_similarity(Pathway1, Pathway2, dico_er_per_pathway, nbEr_total)\n",
    "        distribution_weight_er.append(weight_er)\n",
    "        dico_next_step_er[key] = weight_er\n",
    "\n",
    "weighted_graph = pd.DataFrame(columns=['source', 'interaction', 'target', 'weight'])\n",
    "counter_rows = 0\n",
    "for item, row in nextsteppathway.iterrows():\n",
    "    if row[1] == \"abstraction:NextStepPathway\":\n",
    "        weighted_graph.at[counter_rows, 'source'] = row[0]\n",
    "        weighted_graph.at[counter_rows, 'interaction'] = row[1]\n",
    "        weighted_graph.at[counter_rows, 'target'] = row[2]\n",
    "        key = f\"{str(row[0])}->{str(row[2])}\"\n",
    "        weight = dico_next_step_er[key]\n",
    "        weighted_graph.at[counter_rows, 'weight'] = weight\n",
    "    counter_rows += 1\n",
    "weighted_graph.to_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_NextStepPathway_ERcontent.csv\", sep=\",\", header=True, index=False)\n",
    "\n",
    "# CONCATENATE GRAPHS\n",
    "weighted_is_a_component_of = pd.read_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_IsAComponentOf_ResnikER.csv\", sep=\",\", header=0)\n",
    "print(weighted_is_a_component_of.head())\n",
    "\n",
    "weighted_next_step_pathway = pd.read_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_NextStepPathway_ERcontent.csv\", sep=\",\", header=0)\n",
    "print(weighted_next_step_pathway.head())\n",
    "\n",
    "global_abstraction = pd.concat([weighted_is_a_component_of, weighted_next_step_pathway], axis=0)\n",
    "global_abstraction.to_csv(f\"../../Results/PathwayAbstraction/TGFbeta/R-HSA-170834_WeightedPathwayAbstraction.csv\", sep=\",\", index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "16dea095",
   "metadata": {},
   "outputs": [],
   "source": [
    "process.kill()\n",
    "time.sleep(30)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
